spec/cassettes/TNSPaymentsGateway_Facade/payments/with_merchant_information/can_annotate_order_with_merchant_information.yml

---
http_interactions:
- request:
    method: post
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/session"
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 13 Feb 2018 00:50:37 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '150'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de2372544c6f2054022ae2ca22ab379f252cc83665ec6213eab068f5f962fd668f7c6717c2261842f5562a700a7feab6fa2;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"merchant":"<TNS_PAY_URL:MERCHANT_ID>","result":"SUCCESS","session":{"id":"SESSION0002314870635N6921717K82","updateStatus":"NO_UPDATE","version":"8d706e5201"}}'
    http_version: 
  recorded_at: Tue, 13 Feb 2018 00:50:37 GMT
- request:
    method: put
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/session/SESSION0002314870635N6921717K82"
    body:
      encoding: UTF-8
      string: '{"sourceOfFunds":{"provided":{"card":{"number":"4005550000000019","expiry":{"month":"5","year":"21"},"securityCode":"123"}}}}'
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 13 Feb 2018 00:50:37 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '324'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de2806062e5660d4b2ea893aaa922f33c855d35fafe2ec7eeb201f138439fe9d9787e9837843e1d09bb0b96b84afce9001d;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"merchant":"<TNS_PAY_URL:MERCHANT_ID>","session":{"id":"SESSION0002314870635N6921717K82","updateStatus":"SUCCESS","version":"3cccab0502"},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","number":"400555xxxxxx0019","scheme":"VISA","securityCode":"xxx"}}},"version":"46"}'
    http_version: 
  recorded_at: Tue, 13 Feb 2018 00:50:37 GMT
- request:
    method: put
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/order/43a3c474ef5473b794d63fb7fe87d0d59e79d81f/transaction/PAY"
    body:
      encoding: UTF-8
      string: '{"apiOperation":"PAY","sourceOfFunds":{"type":"CARD"},"session":{"id":"SESSION0002314870635N6921717K82"},"order":{"amount":"100.00","currency":"AUD","statementDescriptor":{"address":{"country":"AUS"},"name":"Charity
        McCharityFace","phone":"555-8675309"}}}'
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 13 Feb 2018 00:50:37 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '1513'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de2db8f7e79004af9ffd018b5263bbb32a309afeb6f3a03070c214ea8f2f09fe5737309c7f56702332b4757cce31a0d1bdf;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"gatewayEntryPoint":"WEB_SERVICES_API","merchant":"<TNS_PAY_URL:MERCHANT_ID>","order":{"amount":100.00,"chargeback":{"amount":0,"currency":"AUD"},"creationTime":"2018-02-13T00:50:37.481Z","currency":"AUD","id":"43a3c474ef5473b794d63fb7fe87d0d59e79d81f","statementDescriptor":{"address":{"country":"AUS"},"name":"Charity
        McCharityFace","phone":"555-8675309"},"status":"CAPTURED","totalAuthorizedAmount":100.00,"totalCapturedAmount":100.00,"totalRefundedAmount":0.00},"response":{"acquirerCode":"00","gatewayCode":"APPROVED"},"result":"SUCCESS","risk":{"response":{"gatewayCode":"ACCEPTED","review":{"decision":"NOT_REQUIRED"},"rule":[{"data":"400555","name":"MERCHANT_BIN_RANGE","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"SUSPECT_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"TRUSTED_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"data":"400555","name":"MSO_BIN_RANGE","recommendation":"NO_ACTION","type":"MSO_RULE"}]}},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","issuer":"JPMORGAN
        CHASE BANK, N.A.","number":"400555xxxxxx0019","scheme":"VISA"}},"type":"CARD"},"timeOfRecord":"2018-02-13T00:50:37.481Z","transaction":{"acquirer":{"batch":20180213,"id":"STGEORGE","merchantId":"057998208845778"},"amount":100.00,"authorizationCode":"055291","currency":"AUD","frequency":"SINGLE","id":"PAY","receipt":"180213055291","source":"INTERNET","terminal":"08845778","type":"PAYMENT"},"version":"46"}'
    http_version: 
  recorded_at: Tue, 13 Feb 2018 00:50:37 GMT
- request:
    method: get
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/order/43a3c474ef5473b794d63fb7fe87d0d59e79d81f"
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 13 Feb 2018 00:50:37 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '2503'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de21effc31c9961b808c3f5e1b0cb88c24d1c395fa469079f10d73256d4c00b086928603b0d2ba11e9de309b7381e5b5488;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"amount":100.00,"chargeback":{"amount":0,"currency":"AUD"},"creationTime":"2018-02-13T00:50:37.481Z","currency":"AUD","id":"43a3c474ef5473b794d63fb7fe87d0d59e79d81f","merchant":"<TNS_PAY_URL:MERCHANT_ID>","result":"SUCCESS","risk":{"response":{"gatewayCode":"ACCEPTED","review":{"decision":"NOT_REQUIRED"},"rule":[{"data":"400555","name":"MERCHANT_BIN_RANGE","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"SUSPECT_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"TRUSTED_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"data":"400555","name":"MSO_BIN_RANGE","recommendation":"NO_ACTION","type":"MSO_RULE"}]}},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","issuer":"JPMORGAN
        CHASE BANK, N.A.","number":"400555xxxxxx0019","scheme":"VISA"}},"type":"CARD"},"status":"CAPTURED","totalAuthorizedAmount":100.00,"totalCapturedAmount":100.00,"totalRefundedAmount":0.00,"transaction":[{"gatewayEntryPoint":"WEB_SERVICES_API","merchant":"<TNS_PAY_URL:MERCHANT_ID>","order":{"amount":100.00,"chargeback":{"amount":0,"currency":"AUD"},"creationTime":"2018-02-13T00:50:37.481Z","currency":"AUD","id":"43a3c474ef5473b794d63fb7fe87d0d59e79d81f","statementDescriptor":{"address":{"country":"AUS"},"name":"Charity
        McCharityFace","phone":"555-8675309"},"status":"CAPTURED","totalAuthorizedAmount":100.00,"totalCapturedAmount":100.00,"totalRefundedAmount":0.00},"response":{"acquirerCode":"00","gatewayCode":"APPROVED"},"result":"SUCCESS","risk":{"response":{"gatewayCode":"ACCEPTED","review":{"decision":"NOT_REQUIRED"},"rule":[{"data":"400555","name":"MERCHANT_BIN_RANGE","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"SUSPECT_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"TRUSTED_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"data":"400555","name":"MSO_BIN_RANGE","recommendation":"NO_ACTION","type":"MSO_RULE"}]}},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","issuer":"JPMORGAN
        CHASE BANK, N.A.","number":"400555xxxxxx0019","scheme":"VISA"}},"type":"CARD"},"timeOfRecord":"2018-02-13T00:50:37.481Z","transaction":{"acquirer":{"batch":20180213,"id":"STGEORGE","merchantId":"057998208845778"},"amount":100.00,"authorizationCode":"055291","currency":"AUD","frequency":"SINGLE","id":"PAY","receipt":"180213055291","source":"INTERNET","terminal":"08845778","type":"PAYMENT"},"version":"46"}]}'
    http_version: 
  recorded_at: Tue, 13 Feb 2018 00:50:37 GMT
recorded_with: VCR 4.0.0
