spec/cassettes/TNSPaymentsGateway_Facade/payments/can_retrieve_details_after_a_purchase.yml

---
http_interactions:
- request:
    method: post
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/session"
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Fri, 09 Feb 2018 05:22:28 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '150'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de2bf5012edde449b6687f81573ba27d6a805ddf3c4e8edab352a5bbd58dd85a4fed318c32045515580ba1b2b556ca6e7c1;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"merchant":"<TNS_PAY_URL:MERCHANT_ID>","result":"SUCCESS","session":{"id":"SESSION0002957346086L70563503K3","updateStatus":"NO_UPDATE","version":"6e0007be01"}}'
    http_version: 
  recorded_at: Fri, 09 Feb 2018 05:22:28 GMT
- request:
    method: put
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/session/SESSION0002957346086L70563503K3"
    body:
      encoding: UTF-8
      string: '{"sourceOfFunds":{"provided":{"card":{"number":"4005550000000019","expiry":{"month":"5","year":"21"},"securityCode":"123"}}}}'
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 09 Feb 2018 05:22:28 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '324'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de2bf0d20bac01108075280981502d67dd72857f3e10e13934c27819d4b0de264e55ed64cff95dde629dd3cbe572af1635e;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"merchant":"<TNS_PAY_URL:MERCHANT_ID>","session":{"id":"SESSION0002957346086L70563503K3","updateStatus":"SUCCESS","version":"c477fe6f02"},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","number":"400555xxxxxx0019","scheme":"VISA","securityCode":"xxx"}}},"version":"46"}'
    http_version: 
  recorded_at: Fri, 09 Feb 2018 05:22:28 GMT
- request:
    method: put
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/order/084a07e28120bf709b33c64cc594299783a1fe9c/transaction/PAY"
    body:
      encoding: UTF-8
      string: '{"apiOperation":"PAY","sourceOfFunds":{"type":"CARD"},"session":{"id":"SESSION0002957346086L70563503K3"},"order":{"amount":"100.00","currency":"AUD"}}'
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Fri, 09 Feb 2018 05:22:28 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '1408'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de213cd4467710ef01fe4d666a9c5ec1c26f6244e5d55af50c8128bb719e4ffeb89ca95eabe8ac4e63185fc13d953759103;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"gatewayEntryPoint":"WEB_SERVICES_API","merchant":"<TNS_PAY_URL:MERCHANT_ID>","order":{"amount":100.00,"chargeback":{"amount":0,"currency":"AUD"},"creationTime":"2018-02-09T05:22:28.389Z","currency":"AUD","id":"084a07e28120bf709b33c64cc594299783a1fe9c","status":"CAPTURED","totalAuthorizedAmount":100.00,"totalCapturedAmount":100.00,"totalRefundedAmount":0.00},"response":{"acquirerCode":"00","gatewayCode":"APPROVED"},"result":"SUCCESS","risk":{"response":{"gatewayCode":"ACCEPTED","review":{"decision":"NOT_REQUIRED"},"rule":[{"data":"400555","name":"MERCHANT_BIN_RANGE","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"SUSPECT_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"TRUSTED_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"data":"400555","name":"MSO_BIN_RANGE","recommendation":"NO_ACTION","type":"MSO_RULE"}]}},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","issuer":"JPMORGAN
        CHASE BANK, N.A.","number":"400555xxxxxx0019","scheme":"VISA"}},"type":"CARD"},"timeOfRecord":"2018-02-09T05:22:28.389Z","transaction":{"acquirer":{"batch":20180209,"id":"STGEORGE","merchantId":"057998208845778"},"amount":100.00,"authorizationCode":"055262","currency":"AUD","frequency":"SINGLE","id":"PAY","receipt":"180209055262","source":"INTERNET","terminal":"08845778","type":"PAYMENT"},"version":"46"}'
    http_version: 
  recorded_at: Fri, 09 Feb 2018 05:22:28 GMT
- request:
    method: get
    uri: "<TNS_PAY_URL:HOST>/api/rest/version/52/merchant/<TNS_PAY_URL:MERCHANT_ID>/order/084a07e28120bf709b33c64cc594299783a1fe9c/transaction/PAY"
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.14.0
      Authorization:
      - Basic bWVyY2hhbnQuVEVTVEVWSEVST1NURzAzOjMzMjk2YjA2ZGUwMzQ4Yjg5MTQ5ZmE2YjhlMjQwMjY0
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 09 Feb 2018 05:22:28 GMT
      Pragma:
      - no-cache
      Cache-Control:
      - no-cache, no-store, must-revalidate
      Expires:
      - '0'
      Content-Type:
      - application/json;charset=ISO-8859-1
      Content-Length:
      - '1408'
      Set-Cookie:
      - TS01f8f5b8=01fb8d8de25749619fe1d0046f00cc60f73593f4570c1c270f18929ffea39fab1e2b9852114f232f0a2b6015a2c24d99a8fcd480cd;
        Path=/; HTTPOnly
    body:
      encoding: ASCII-8BIT
      string: '{"gatewayEntryPoint":"WEB_SERVICES_API","merchant":"<TNS_PAY_URL:MERCHANT_ID>","order":{"amount":100.00,"chargeback":{"amount":0,"currency":"AUD"},"creationTime":"2018-02-09T05:22:28.389Z","currency":"AUD","id":"084a07e28120bf709b33c64cc594299783a1fe9c","status":"CAPTURED","totalAuthorizedAmount":100.00,"totalCapturedAmount":100.00,"totalRefundedAmount":0.00},"response":{"acquirerCode":"00","gatewayCode":"APPROVED"},"result":"SUCCESS","risk":{"response":{"gatewayCode":"ACCEPTED","review":{"decision":"NOT_REQUIRED"},"rule":[{"data":"400555","name":"MERCHANT_BIN_RANGE","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"SUSPECT_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"name":"TRUSTED_CARD_LIST","recommendation":"NO_ACTION","type":"MERCHANT_RULE"},{"data":"400555","name":"MSO_BIN_RANGE","recommendation":"NO_ACTION","type":"MSO_RULE"}]}},"sourceOfFunds":{"provided":{"card":{"brand":"VISA","expiry":{"month":"5","year":"21"},"fundingMethod":"CREDIT","issuer":"JPMORGAN
        CHASE BANK, N.A.","number":"400555xxxxxx0019","scheme":"VISA"}},"type":"CARD"},"timeOfRecord":"2018-02-09T05:22:28.389Z","transaction":{"acquirer":{"batch":20180209,"id":"STGEORGE","merchantId":"057998208845778"},"amount":100.00,"authorizationCode":"055262","currency":"AUD","frequency":"SINGLE","id":"PAY","receipt":"180209055262","source":"INTERNET","terminal":"08845778","type":"PAYMENT"},"version":"46"}'
    http_version: 
  recorded_at: Fri, 09 Feb 2018 05:22:28 GMT
recorded_with: VCR 4.0.0
